

friends = ['дмитро', 'анастасія', 'сашко']
print('Любий, ' + friends[0].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Люба, ' + friends[1].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Любий, ' + friends[2].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('\n')
print(friends[2].title() + ' на жаль, прийти не зможе.')
print('\n')
friends[2] = 'данило'
print('Любий, ' + friends[0].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Люба, ' + friends[1].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Любий, ' + friends[2].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('\n')
print('Гостей буде більше, адже мені таки вдалось придбати новий стіл!')
print('\n')
friends.insert(0, 'Іван')
friends.insert(2, 'Владислав')
friends.append('Аліна')
print('Любий, ' + friends[0].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Люба, ' + friends[1].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Любий, ' + friends[2].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Любий, ' + friends[3].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Люба, ' + friends[4].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')
print('Любий, ' + friends[5].title() + ', я хочу запросити тебе на вечерю! Чекаю на зустріч!')

